#PP2(PP1.txtのデータを項目ごとに並べ変える)

function PP2{

 #-----------------------------------------------------------------------------------
 #「PP2.txt」を新規作成する
 New-Item PP2.txt -ItemType file -Force
 #-----------------------------------------------------------------------------------

 #-----------------------------------------------------------------------------------
 #「PP1.txt」の内容を変数dataにセット
 $data=Get-Content PP1.txt
 #-----------------------------------------------------------------------------------

 #-----------------------------------------------------------------------------------
 #「PP1.txt」の"Data_1:"を含む行の行数を変数lines_Zにセット
 $lines_Z=Select-String "Data_1:" PP1.txt | ForEach-Object {$($_ -split":")[1]}

 foreach ($item in $lines_Z) {

 #「PP2.txt」に追記モードで記述する
 $data[$item-1] | Out-File -FilePath PP2.txt -Append

 }
 #-----------------------------------------------------------------------------------

 #-----------------------------------------------------------------------------------
 #「PP1.txt」の"Data_2:"を含む行の行数を変数lines_Zにセット
 $lines_Z=Select-String "Data_2:" PP1.txt | ForEach-Object {$($_ -split":")[1]}

 foreach ($item in $lines_Z) {

 #「PP2.txt」に追記モードで記述する
 $data[$item-1] | Out-File -FilePath PP2.txt -Append

 }
 #-----------------------------------------------------------------------------------

 #-----------------------------------------------------------------------------------
 #「PP1.txt」の"Data_3:"を含む行の行数を変数lines_Zにセット
 $lines_Z=Select-String "Data_3:" PP1.txt | ForEach-Object {$($_ -split":")[1]}

 foreach ($item in $lines_Z) {

 #「PP2.txt」に追記モードで記述する
 $data[$item-1] | Out-File -FilePath PP2.txt -Append

 }
 #-----------------------------------------------------------------------------------

 #-----------------------------------------------------------------------------------
 #「PP1.txt」の"Data_4:"を含む行の行数を変数lines_Zにセット
 $lines_Z=Select-String "Data_4:" PP1.txt | ForEach-Object {$($_ -split":")[1]}

 foreach ($item in $lines_Z) {

 #「PP2.txt」に追記モードで記述する
 $data[$item-1] | Out-File -FilePath PP2.txt -Append

 }
 #-----------------------------------------------------------------------------------
}
